{
    "@id": "dtmi:digitaltwins:ngsi_ld:cim:energy:PhaseTapChangerLinear;1",
    "@type": "Interface",
    "displayName": "PhaseTapChangerLinear",
    "comment": "Describes a tap changer with a linear relation between the tap step and the phase angle difference across the transformer. This is a mathematical model that is an approximation of a real phase tap changer.\nThe phase angle is computed as stepPhaseShiftIncrement times the tap position.\nThe voltage magnitude of both sides is the same.",
    "description": "Adapted from CIM and https://github.com/smart-data-models/dataModel.EnergyCIM/ data models",
    "contents": [
        {
            "@type": "Property",
            "name": "stepPhaseShiftIncrement",
            "comment": "Phase shift per step position. A positive value indicates a positive angle variation from the Terminal at the  PowerTransformerEnd,  where the TapChanger is located, into the transformer.\nThe actual phase shift increment might be more accurately computed from the symmetrical or asymmetrical models or a tap step table lookup if those are available.",
            "schema": "float",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "xMax",
            "comment": "The reactance depends on the tap position according to a \"u\" shaped curve. The maximum reactance (xMax) appears at the low and high tap positions. Depending on the “u” curve the attribute can be either higher or lower than PowerTransformerEnd.x.",
            "schema": "float",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "xMin",
            "comment": "The reactance depends on the tap position according to a \"u\" shaped curve. The minimum reactance (xMin) appears at the mid tap position.  PowerTransformerEnd.x shall be consistent with PhaseTapChangerLinear.xMin and PhaseTapChangerNonLinear.xMin. In case of inconsistency, PowerTransformerEnd.x shall be used.",
            "schema": "float",
            "writable": true
        }
    ],
    "@context": "dtmi:dtdl:context;2",
    "extends": [
        "dtmi:digitaltwins:ngsi_ld:cim:energy:PhaseTapChanger;1"
    ]
}