{
    "@id": "dtmi:digitaltwins:ngsi_ld:cim:energy:PowerTransformer;1",
    "@type": "Interface",
    "displayName": "PowerTransformer",
    "comment": "An electrical device consisting of  two or more coupled windings, with or without a magnetic core, for introducing mutual coupling between electric circuits. Transformers can be used to control voltage and phase shift (active power flow).\nA power transformer may be composed of separate transformer tanks that need not be identical.\nA power transformer can be modelled with or without tanks and is intended for use in both balanced and unbalanced representations.   A power transformer typically has two terminal",
    "description": "Adapted from CIM and https://github.com/smart-data-models/dataModel.EnergyCIM/ data models",
    "contents": [
        {
            "@type": "Property",
            "name": "Name",
            "description": "Power transformer name. For example, SAMWA0001",
            "writable": true,
            "schema": "string"
        },
        {
            "@type": "Property",
            "name": "PowerTransformerEnd",
            "description": "The power transformer of this power transformer end.",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "beforeShCircuitHighestOperatingCurrent",
            "description": "The highest operating current (Ib in the IEC 60909-0) before short circuit (depends on network configuration and relevant reliability philosophy). It is used for calculation of the impedance correction factor KT defined in IEC 60909-0. Default: 0.0",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "beforeShCircuitHighestOperatingVoltage",
            "description": "The highest operating voltage (Ub in the IEC 60909-0) before short circuit. It is used for calculation of the impedance correction factor KT defined in IEC 60909-0. This is worst case voltage on the low side winding (Section 3.7.1 in the standard). Used to define operating conditions. Default: 0.0",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "beforeShortCircuitAnglePf",
            "description": "The angle of power factor before short circuit (phib in the IEC 60909-0). It is used for calculation of the impedance correction factor KT defined in IEC 60909-0. This is the worst case power factor. Used to define operating conditions. Default: 0.0",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "highSideMinOperatingU",
            "description": "The minimum operating voltage (uQmin in the IEC 60909-0) at the high voltage side (Q side) of the unit transformer of the power station unit. A value well established from long-term operating experience of the system. It is used for calculation of the impedance correction factor KG defined in IEC 60909-0 Default: 0.0",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "isPartOfGeneratorUnit",
            "description": "Indicates whether the machine is part of a power station unit. Used for short circuit data exchange according to IEC 60909 Default: False",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Property",
            "name": "operationalValuesConsidered",
            "description": "It is used to define if the data (other attributes related to short circuit data exchange) defines long term operational conditions or not. Used for short circuit data exchange according to IEC 60909. Default: False",
            "schema": "double",
            "writable": true
        },
        {
            "@type": "Relationship",
            "name": "MemberOf_Substation",
            "description": "The associations for PowerTransformer containment are: Substation -> PowerTransformer -> TransformerWinding",
            "target": "dtmi:digitaltwins:ngsi_ld:cim:energy:Substation;1"
        },
        {
            "@type": "Relationship",
            "name": "PowerTransformerEnds",
            "target": "dtmi:digitaltwins:ngsi_ld:cim:energy:PowerTransformerEnd;1",
            "comment": "The ends of this power transformer.",
            "displayName": "PowerTransformerEnd"
        }
    ],
    "@context": "dtmi:dtdl:context;2",
    "extends": [
        "dtmi:digitaltwins:ngsi_ld:cim:energy:ConductingEquipment;1"
    ]
   
}